Revit 2027 API
FailureDefinition.SetDefaultResolutionType Method
 Sets the default resolution type for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureDefinition SetDefaultResolutionType(
	FailureResolutionType type
)
Public Function SetDefaultResolutionType (
	type As FailureResolutionType
) As FailureDefinition
public:
FailureDefinition^ SetDefaultResolutionType(
	FailureResolutionType type
)
member SetDefaultResolutionType :
        type : FailureResolutionType -> FailureDefinition
Parameters
type FailureResolutionType
 The type of resolution to be used as default.
Return Value
FailureDefinition
 The FailureDefinition.
Exceptions
Exception | Condition
ArgumentException |  Resolution of the type is not applicable to the failure.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  FailureDefinition does not have any resolutions.
Remarks
 If failure has multiple resolutions, one of them is designated as designated as the default resolution. The default resolution is used by Revit failure processing mechanism to resolve failures automatically when applicable.
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace